#Команды
process_start_command = 'Воспользуйся кнопками главного меню для перехода к соответствующему разделу'
process_register_command = 'Для того, чтобы зарегистрироваться введи /regproc или, в случае возникновения проблем, нажми на кнопку помощи'

#Регистрация
process_register_help_button = 'Вот наши контакты, обращайся!'
process_register_persnum_command = 'Отлично, давай начнем регистрацию! Сначала введи свой табельный номер (только числа)'
process_register_names_command = 'Теперь введи свои ФИО в формате "Иванов Иван Иванович"'
process_register_phone_command = 'А теперь - мобильный телефон в формате "89979999090"'
process_register_finish_command = 'А теперь - мобильный телефон в формате "89979999090"'
process_register_failed_command = 'Ошибка регистрации! Возможно, не совпадает табельный номер, имя или ваш аккаунт уже зарегистрирован. Попробуйте еще раз или обратитесь за помощью'

#Рейтинг
process_rate_start = 'Перед тем как оценить ментора, введи его ФИО (для проверки соответствия с базой данных)'
raise_error_rate_start = 'Ошибка! Твой аккаунт не авторизован или отсутствует в базе. Попробуй зарегистрироваться /register или обратись за помощью /help'
process_rate_mentor_check = 'Отлично, твои данные обнаружены и совпадают! Оцени ментора с помощью всплывшего ниже меню (шкала от 1 до 5)'
raise_error_rate_mentor_check = 'Перепроверь данные и начни сначала. Если ментор изменился, сообщи об этом куратору и измени данные в настройках'
process_rate_finish = 'Спасибо за оценку! Теперь оставь, пожалуйста, пару слов о своих ощущениях или пожеланиях :)'

#Команды главного меню
process_faq_button = 'Ты в меню ответов на часто задаваемые вопросы (FAQ)'
process_faq_back_button = 'Ты снова в главном меню бота'
process_info_button = 'Держи .pdf, который расскажет тебе основное о стажировке!'
process_task_button = 'Вот твоя рассылка на сегодняшний день!'
process_star_button = 'Отметь, как тебе понравился ментор по шкале от 1 до 5'

#Команды меню FAQ
process_faq_salary1_button = 'Тут будет информация о зарплате стажера'
process_faq_salary2_button = 'Тут будет информация о начислении зарплаты'
process_faq_vacation_button = 'Тут будет информация об отпуске'
process_faq_practice_button = 'Тут будет информация о практике'
process_faq_tks_button = 'Тут будет информация о резервировании ТКС-ВКС'
process_faq_hours_button = 'Тут будет информация о том, как изменить часы работы'
process_faq_contacts_button = 'Вот наши контакты :)'
process_faq_back_button = 'Ты снова в главном меню бота'

#Реакции на звезды
process_star_1_button = 'Реакция на оценку 1/5'
process_star_2_button = 'Реакция на оценку 2/5'
process_star_3_button = 'Реакция на оценку 3/5'
process_star_4_button = 'Реакция на оценку 4/5'
process_star_5_button = 'Реакция на оценку 5/5'